###Problema de Negocio
Exite alguma relacao entre a area de imoveis em metros quadrados e o valor em uma determinada cidade? caso exista a relacao, como podemos mensura-la

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import statsmodels.api as sm

In [ ]:
#Carregando os dados e realizando analise explorat√≥ria
df = pd.read_csv('dataset.csv')

In [3]:
df.shape

(3000, 7)

In [4]:
df.columns

Index(['valor_aluguel', 'area_m2', 'ano_construcao', 'codigo_localidade',
       'numero_banheiros', 'numero_cozinhas', 'codigo_bairro'],
      dtype='object')

In [5]:
df.head()

,valor_aluguel,area_m2,ano_construcao,codigo_localidade,numero_banheiros,numero_cozinhas,codigo_bairro
0,120.97436,35,1939,1,0,0,1112
1,436.97433,104,1939,1,1,0,1112
2,355.74360,29,1971,2,0,0,2114
3,282.92310,39,1972,2,0,0,2148
4,807.23080,97,1985,1,0,0,2222

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   valor_aluguel      3000 non-null   float64
 1   area_m2            3000 non-null   int64
 2   ano_construcao     3000 non-null   int64
 3   codigo_localidade  3000 non-null   int64
 4   numero_banheiros   3000 non-null   int64
 5   numero_cozinhas    3000 non-null   int64
 6   codigo_bairro      3000 non-null   int64
dtypes: float64(1), int64(6)
memory usage: 164.2 KB